// Author = None None None
// Group = None
// Date = 27.10.2025

/*
2:
Студент Вася очень любит курс «Компьютерная безопасность». Однажды Васе
задали домашнее задание зашифровать данные, переданные в сообщении. Недолго
думая, Вася решил заменить все целые числа на функцию от этого числа. Функцию
он придумал не сложную 5x^3−13 , где x −исходное число . Помогите Васе с его
домашним заданием.
Предусмотреть ситуацию, когда в тексте будут не только целые числа, но и любые
символы.
 */

class Informatics_Lab3_Task2 {

    public static void main(String[] args) {
        
    }
}
