// Author = None None None
// Group = None
// Date = 27.10.2025

/*
1:
Вам необходимо поменять падежи в тексте у прилагательных, которые встречаются
несколько раз. На вход подаётся текст и порядковый номер слова, падежная форма
которого будет использована для замены.
Пример ввода:
1)Номер 2
2)Текст:
Футбольный клуб «Реал Мадрид» является 15-кратным обладателем главного
футбольного европейского трофея – Лиги Чемпионов. Данный турнир организован
Союзом европейских футбольных ассоциаций (УЕФА). Идея о континентальном
футбольном турнире пришла к журналисту Габриэлю Ано в 1955 году.

 */

public class Informatics_Lab3_Task3 {
}
